website/docs/api/wazo-router-confd/description.md
```mermaid
graph TD
    subgraph Users
        direction TB
        carrier["Carrier Trunk<br>Routes inbound traffic to and terminates outbound traffic from the C5 infrastructure."]
        ipbx["IPBX<br>CLASS 5 infrastructure, one or multiple PBX running CLASS 5 services."]
        subscriber["Subscriber<br>Generic SIP account of the platform using the CLASS 5 services."]
    end

    subgraph CLASS4
        direction TB
        sbc["SBC<br>Kamailio<br>Session Board Controller, protects the C4 infrastructure from abuses, attacks and overloads."]:::doc
        router["Router<br>Kamailio<br>Dynamically routes the traffic based on configuration rules and settings."]:::doc
        router_confd["Router confd API<br>FastAPI<br>Router Configuration API, exposes a REST webservice."]
        redis["Redis Cache<br>Redis<br>Redis Cache for C4 components."]
        postgresql["Database<br>PostgreSQL<br>Relational database for C4 components."]
    end

    rtpengine["Media Proxy<br>RTPEngine<br>Media Proxy, based on RTPEngine"]:::doc

    carrier -->|SIP| sbc
    ipbx -->|SIP| sbc
    subscriber -->|SIP| sbc

    sbc -->|SIP| router
    router -->|REST| router_confd
    router_confd -->|SQL| postgresql
    router -->|RTPEngine| rtpengine

    sbc -->|REDIS| redis
    router -->|REDIS| redis
    router_confd -->|REDIS| redis

    classDef doc fill:#f9f,stroke:#333,stroke-width:2px;
```
